/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "Ustawienia Konta";
"you_need_an_account" = "Brak kont $appname na twoim urządzeniu.↩\nW celu użycia tej aplikacji musisz je najpierw stworzyć.";

//Login Screen
"testing_connection" = "Testuję połączenie";
"server_instance_not_found" = "Nie znaleziono serwera";
"secure_connection_established" = "Secure Connection";
"https_non_secure_connection_established" = "Przekierowano do niezabezpieczonego połączenia";
"connection_established" = "Non-secure Connection";
"login_details" = "Szczegóły logowania";
"username" = "Nazwa użytkownika";
"password" = "Hasło";
"login" = "Połącz";
"cancel" = "Anuluj";
"error_login_message" = "Nazwa użytkownika lub hasło są nieprawidłowe";
"error_updating_predefined_url" = "Serwer zmienił adres URL. Proszę zaloguj się na swoje konto na nowym adresie. ";
"ok" = "OK";
"url_sample" = "Adres serwera https://...";
"forbidden_characters_in_password" = "To hasło zawiera niedozwolone znaki";
"server" = "Serwer";
"url" = "URL";
"session_expired" = "Twoja sesja wygasła. Proszę zaloguj się ponownie";
"credentials_different_user" = "Podany login nie pasuje do użytkowników ";
"auth_unsupported_auth_method" = "Serwer nie obsługuje tej metody autoryzacji";
"server_does_not_give_user_id" = "Serwer nie zwraca prawidłowego identyfikatora użytkownika. \nSkontaktuj się z administratorem.";
"authentification_not_valid" = "Błąd autoryzacji na tym serwerze";
"error_too_many_http_redirects" = "Wystąpił błąd podczas próby nawiązania połączenia. \nSpróbuj jeszcze raz.";
"retry" = "Powtórz";
"help_link_login" = "Nowy w $appname?";
"error_could_not_add_account" = "Could not store user information. Please try again.";
"account_not_new" = "Konto tego samego użytkownika i serwera już istnieje na tym urządzeniu";
"oauth2_error_access_denied" = "Dostęp zabroniony przez serwer autoryzacji";
"oauth2_error" = "Nieudana autoryzacja";

//TabBarItems
"settings"="Ustawienia";
"files_tab"="Pliki";

//Uploading
"upload" = "Wyślij";
"account" = "Konto:";
"location" = "Lokalizacja:";
"photo_albums" = "Albumy zdjęć";
"loading" = "Ładowanie...";
"no_access_to_gallery" = "Włącz dostęp do zdjęć i klipów wideo dla aplikacji $appname. Tę opcję znajdziesz w Ustawienia > Prywatność > Zdjęcia";
"error" = "Błąd";
"upload_failed"="Przesyłanie nie powiodło się";
"redirection_problem"="Przekierowanie URL nie jest wspierane";
"all_photos" = "Wszystkie zdjęcia";

//First View
"menu_upload" = "Prześlij zdjęcie lub klip wideo";
"menu_folder" = "Nowy folder";
"menu_text_file" = "Nowy plik tekstowy";
"sort_menu_title" = "Sortuj";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Najnowsze-Najstarsze";
"sort_menu_by_kind_option" = "Kind";

//Create/Edit File Text
"create_text_file" = "Utwórz nowy plik tekstowy";
"title_view_new_text_file" = "Nowy plik tekstowy";
"title_view_edit_text_file" = "Edytuj plik tekstowy";
"default_text_file_title" = "Nowy plik tekstowy";
"title_text_file_placeholder" = "Nazwa pliku...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "Już istnieje";
"error_file_name_empty" = "Nazwa pliku nie może być pusta.";
"no_changes_made" = "Nie dokonano żadnych zmian";
"no_file_downloaded" = "Ten plik nie został pobrany, nie możesz go edytować";


//Create Folder
"create_folder" = "Utwórz nowy folder";
"folder_name" = "Podaj nazwę folderu:";
"save" = "Zapisz";
"folder_exist" = "Folder o podanej nazwie już istnieje. Podaj inną nazwę.";
"folder_create_error"="Nie można utworzyć katalogu";
"not_show_potrait"="Menu nie jest dostępne w widoku poziomym. Zmień widok na pionowy.";
"not_possible_create_folder" = "Folder nie mógł zostać utworzony.";

//FilesView
"confirm_to_delete_item" = "Potwierdź usunięcie rzeczy";
"yes" = "Tak";
"no" = "Nie";
"delete_from_device" = "Czy na pewno chcesz usunąć ten plik z urządzenia?";
"delete_from_server" = "Czy na pewno chcesz usunąć ten plik z serwera?";
"not_possible_connect_to_server" = "Nawiązanie połączenia z serwerem nie jest obecnie możliwe.";
"delete_folder_from_server" = "Czy na pewno chcesz usunąć ten folder z serwera?";
"delete_local_server" = "Usuń z urządzenia i z serwera";
"delete_local" = "Usuń z urządzenia";
"delete_server" = "Usuń z serwera";
"error_path" = "Not found. Please make sure it exists";
"error_not_permission" = "Nie masz uprawnień do zrealizowania tej operacji";
"folders" = "foldery";
"files" = "plik";
"folder" = "folder";
"file" = "plik";
"more_swipe" = "Więcej";
"message_not_files" = "Pusto. Wyślij coś!";
"maintenance_mode_on_server_message" = "Nawiązanie połączenia z serwerem nie jest obecnie możliwe. Serwer jest w trybie serwisowym.";

//Refresh file list
"release_refresh"="Puść, aby odświeżyć...";
"loading_refresh"="Ładowanie...";
"pull_down_refresh"="Pociągnij w dół, aby odświeżyć.";

//Miscelanea
"back" = "Wróć";

//Preview
"open_with_label" = "Otwórz za pomocą";
"delete_label"= "Usuń";

//Open with
"file_cannot_be_opened" = "Nie można otworzyć pliku";
"no_app_instaled_to_open_it" = "Brak zainstalowanej aplikacji umożliwiającej odczyt tego rodzaju pliku.";

//WTClient messages (Download/Upload)
"establishing_connection" = "Nawiązuję połączenie";
"not_establishing_connection" = "Próba nawiązania połączenia nie powiodła się";
"connection_closed" = "Połączenie zamknięte";
"connection_lost" = "Połączenie zostało utracone";
"auth_failed" = "Uwierzytelnianie przebiegło niepomyślnie";
"auth_passed" = "Uwierzytelnianie przebiegło pomyślnie";
"request_file_not_found" = "Wskazany plik nie został odnaleziony na serwerze";
"request_file_not_accesed" = "Brak dostępu do wskazanego pliku";
"unknow_response_server" = "Błąd. Nieoczekiwana odpowiedź serwera.";
"uploading_data" = "Przesyłanie danych";
"downloading_data" = "Pobieranie danych";
"transfer_complete" = "Przesyłanie ukończone";
"transfer_failed" = "Przesyłanie przebiegło niepomyślnie";
"download_file" = "Pobierz plik";

//Settings and PinCode
"title_app_pin" = "Kod zabezpieczający";
"title_app_pin_and_touchID" = "Kod zabezpieczający & Touch ID";
"title_app_pin_and_faceID" = "Passcode Lock & Face ID";
"title_app_pin_forced" = "Zmień kod zabezpieczający";
"enter_app_pin" = "Wpisz kod PIN";
"enter_app_pin_long_description_forced" = "Wymagany jest kod zabezpieczający. Ustaw go żeby się zalogować.";
"enter_app_pin_long_description" = "Wpisz kod PIN";
"reenter_app_pin" = "Wpisz kod PIN ponownie";
"remove_app_pin" = "Usuń kod PIN";
"both_pass_not_same" = "Podane kody PIN są różne";
"app_pin_incorrect" = "Kod PIN jest nieprawidłowy";
"passcode_not_enabled" = "Najpierw włącz kod PIN";
"title_app_touchID" = "Touch ID";
"title_app_faceID" = "Face ID";
"disconnect_button" = "Odłącz się od tego serwera";
"pin_removed" = "Hasło zostało usunięte";
"incorrect_pin" = "Nieprawidłowy kod PIN";
"app_pin_stored" = "Hasło zostało zapisane";
"help" = "Pomoc";
"recommend_to_friend" = "Poleć znajomemu";
"send_feedback" = "Wyślij opinię lub sugestię";
"manage_accounts" = "Zarządzaj kontami";
"add_new_account" = "Dodaj nowe konto";
"save_changes" = "Zapisz";
"add_account" = "Dodaj";
"user_exist" = "Podany użytkownik już istnieje";
"imprint_button" = "Impressum";
"title_instant_upload_photos"="Automatyczne wysyłanie zdjęć";
"title_instant_upload_videos"="Automatyczne wysyłanie wideo";
"title_background_instant_upload" = "Automatyczne wysyłanie w tle";
"accounts_section" = "Konta";
"security_section" = "Bezpieczeństwo";
"instant_updloads_section" = "Automatyczne wysyłanie";
"more_section" = "Więcej";
"unlock_app" = "Odblokuj $appname";
"passcode_forced_can_not_be_disabled" = "Kod zabezpieczający jest wymagany. Nie można go wyłączyć.";
"pending_migration_to_new_url" = "Przejście do nowego URL";

//Downloading
"can_no_copy_to_gallery" = "Ten plik nie może zostać skopiowany do galerii, ponieważ nie może zostać otwarty w galerii";
"file_is_downloading" = "Ten plik już jest w trakcie pobierania";
"download_file_exist" = "Nie można otworzyć tego pliku. Upewnij się, czy istnieje.";
"wait_to_download" = "Przygotowuję do pobierania";
"updating" = "Aktualizuję";
"msg_while_downloads" = "Nie ma możliwości wykonania tej operacji. Poczekaj, aż pobieranie zostanie ukończone.";
"streaming_no_possible_ssl_self_signed" = "Nie można zainicjować strumienowania, gdyż certyfikat serwera nie jest zaufany. Pobieranie pliku rozpocznie się automatycznie.";

//SSL
"invalid_ssl_cert" = "Nie można zweryfikować tożsamości tej strony. Czy mimo to chcesz zaufać temu certyfikatowi?";
"connection_declined" = "Połączenie odrzucone przez użytkownika";
"server_certificate_untrusted" = "Certyfikat serwera jest niezaufany";

//Recent view
"recent_now"="Sekund temu";
"recent_minutes"="$minutes minut temu";
"recent_minute"="$minutes minutę temu";
"recent_hours"="$hours godzin temu";
"recent_hour"="$hours godzinę temu";
"recent_days"="$days dni temu";
"recent_day"="$days dzień temu";
"recent_months"="$months miesięcy temu";
"recent_month"="$months miesiąc temu";

"uploads_tab"="Wysłane";
"current_section"="Obecny";
"uploader_section"="Wysłane";
"nothing_was_upload_recently"="Nic nie zostało ostatnio przesłane z tego urządzenia";
"failed_uploader_section"="Przesyłania zakończone niepowodzeniem";
"clear_successful"="Czyszczenie zakończone pomyślnie";
"error_credential"="Błąd uwierzytelniania";
"error_destiny_does_not_exist"="Błąd folderu";
"error_file_exists"="Konflikt";
"error_permission" = "Błąd uprawnień";
"error_not_allowed_by_firewall_rule" = "Upload nie jest możliwy";
"error_file_does_not_exist" = "Ten plik nie jest już dostępny na tym urzadzeniu";
"error_file_in_background" = "Błąd serwera";
"error_insufficient_storage" = "Brak wystarczającej ilości miejsca na koncie";
"error_file_invalid_characters" = "Nieprawidłowe znaki";
"change_active_user"="Zmień aktywnego użytkownika na";
"waiting_for_server"="Oczekuję na nawiązanie połączenia z serwerem";
"waiting_for_upload"="Oczekuję na przesyłanie";
"error_permission_alert_message" = "Nie masz uprawnień, aby przesyłać do tego folderu";
"choose_folder" = "Wybierz folder";

//Select Folder View
"upload_label"="Prześlij do";
"create_button"="Utwórz";
"choose_button"="Wybierz";

//Rename
"rename_long_press" = "Zmień nazwę";
"rename_file_title" = "Zmień nazwę";
"enter_new_name" = "Podaj nową nazwę:";
"rename_file_exist" = "Plik o podanej nazwie już istnieje, podaj inną nazwę";

//Move
"move_long_press" = "Przenieś";
"move_to_label" = "Przenieś do";
"file_exist" = "Plik istnieje już w folderze docelowym";
"override_file" = "Czy chcesz zastąpić istniejący plik tym plikiem?";
"accept" = "Akceptuj";
"error_folder_destiny_is_the_same" = "BŁĄD: nie można przenieść folderu do niego samego";
"original_file_exist" = "Nie można przenieść pliku. Upewnij się, czy istnieje.";
"original_folder_exist" = "Nie można przenieść folderu. Upewnij się, czy istnieje.";

//Download folfer
"download_folder" = "Folder pobierania";
"cancel_download" = "Anuluj pobieranie";

//Upload from other apps
"other_apps_title" = "Miejsce docelowe";
"other_apps_account" = "Konto";
"other_apps_folder" = "Folder";
"other_apps_file_name" = "Nazwa pliku";
"other_apps_send_to" = "Prześlij do";
"error_moving_file" = "Nie można przenieść pliku. Upewnij się, czy folder docelowy istnieje.";
"forbidden_characters_from_server" = "Nazwa pliku zawiera co najmniej jeden nieprawidłowy znak";
"overwritte_title" = "Zastąp";

//Social
"twitter_message" = "Wypróbuj $twitteruser na Twoim smartfonie!";
"facebook_message" = "Wypróbuj $appname na Twoim smartfonie!↩\n";
"mail_recommendation_subject" = "Wypróbuj $appname na Twoim smartfonie!";
"mail_recommendation_body" = "Chcę zaprosić Cię do skorzystania z $appname na Twoim smartfonie!↩\nPobierz tutaj: ";
"device_not_support_mail" = "Proszę ustawić konto e-mail";
"mail_feedback_subject" = "Opinie i sugestie dla aplikacji $appname";
"account_not_configure" = "Twoje urządzenie nie ma skonfigurowanego konta. Przejdź do ustawień, aby je skonfigurować.";

//Storage
"of_storage" = "z";
"occupied_storage" = "zajęty";
"storage" = "Magazyn";
"storage_upgrade" = "Zwiększ pojemność";

//Jimmies
"this_file_is_older" = "Dostępna jest nowsza wersja";
"msg_update_file_0_bytes" = "Plik na serwerze ma 0 bajtów. Czy chcesz nadpisać istniejący plik tym oto pustym plikiem?";

//Shared
"shared_tab" = "Linki publiczne";
"message_not_shared_files" = "Brak plików lub folderów udostępnionych za pośrednictwem łącza";
"message_not_shared_api_support" = "Udostępnianie nie jest dostępne na twoim serwerze. Skontaktuj się ze swoim administratorem.";
"share_link_long_press" = "Udostępnij";
"unshare_link" = "Anuluj udostępnianie";
"share_not_available_on_this_server" = "Ta funkcja nie jest dostępna na twoim serwerze. Skontaktuj się ze swoim administratorem.";
"copy_link" = "Skopiuj link";
"file_to_share_not_exist" = "Nie można udostępnić tego pliku lub folderu. Upewnij się, czy istnieje.";
"file_to_unshare_not_exist" = "Nie można wyłączyć udostępniania tego pliku lub folderu. Upewnij się, czy istnieje.";
"shared_link_protected_title" = "Wprowadź hasło";
"shared_link_protected_message" = "Żeby współdzielić link musisz ustawić hasło zabezpieczające.";
"pasword_empty" = "Hasło nie może być puste";
"no_pasword" = "Musisz wprowadzić hasło";
"get_share_link" = "Pobierz link publiczny";
"title_share_link_option_name" = "Nazwa linku";
"title_share_link_option_password" = "Hasło";
"title_share_link_option_expiration" = "Wygaśnięcie";
"title_share_link_option_allow_dowload_view" = "Pobieranie / Podgląd";
"title_share_link_option_allow_dowload_view_upload" = "Pobieranie / Podgląd / Wysyłanie";
"title_share_link_option_allow_upload_only" = "Tylko wysyłanie (upuszczanie pliku)";
"placeholder_share_link_option_name" = "Nazwa";
"placeholder_share_link_option_password" = "Wprowadź hasło";
"placeholder_share_link_option_expiration" = "Data wygaśnięcia";
"title_view_create_link" = "Utwórz udostępniany link";
"title_view_edit_link" = "Edytuj udostępniany link";
"title_confirm_delete_link" = "Usuń link";
"message_confirm_delete_link" = "! Skasuj $sharedLink";
"default_link_name" = "link do $fileName";
"allow_editing" = "Pozwól na edycję";
"show_error_password_enforced" = "Wymagane hasło";
"show_error_expiration_enforced" = "Link publiczny wygaśnie nie później niż po $nDays dni od utworzenia";
"default_not_possible_msg" = "Nie można wykonać tej operacji. Spróbuj później";
"share_user_group_indicator" = "grupa";
"share_user_federated_indicator" = "zdalny";
"add_user_or_group_title" = "Dodaj użytkownika i grupę";
"share_with_users_or_groups" = "Użytkownicy i grupy";
"not_share_with_users_yet"= "Plik jeszcze nie współdzielony z żadnym użytkownikiem";
"not_share_by_link_yet"= "Linku publiczny jeszcze nie utworzony";
"not_sharee_api_supported" = "Niestety wersja oprogramowania Twojego serwera nie zezwól współdzielenia z użytkownikami. Skontaktuj się z Administrator systemu";
"share_link_title" = "Linki publiczne";
"warning_sharing_public_link" = "Każdy posiadający link ma dostęp do pliku/katalogu.";
"not_share_link_enabled_capabilities" = "Udostępnianie nie jest włączone na tym serwerze. Administrator serwera musi je włączyć";
"shared_link_cannot_remove_password" = "Nie można usunąć hasła";
"shared_link_cannot_remove_expiration_date" = "Nie można usunąć daty wygaśnięcia. Jest ona wymagana. ";
"shared_link_mail_subject" = "$userName  udostepnił  Ci plik/filder: »$fileOrFolderName« ";
"secured_link" = "Zabezpieczone";
"message_private_link" = "Prywatny link: Tylko użytkownicy, którzy mają przyznany dostęp do folderów lub plików mogą z niego skorzystać. Użyj go jako linka bezpośredniego dla siebie lub jako odnośnik dla użytkowników, którym udostępniasz.";

//Shared privileges
"title_user_can_edit" = "Może edytować";
"title_user_can_share" = "Może współdzielić";
"user_can_create" = "utwórz";
"user_can_change" = "zmiany";
"user_can_delete" = "skasuj";
"title_view_edit_user_privileges" = "Uprawnienia";

//Shared Link Options
"title_view_share_link_options" = "Opcje linku";

//Favorites
"favorite" = "Ulubione";
"unfavorite" = "Usuń z ulubionych";
"parent_folder_is_favorite" = "Folder zawierający ten plik jest już dodany do ulubionych";

//Available offline
"available_offline" = "Dostępne w trybie offline";
"not_available_offline" = "Niedostępne w trybie offline";
"parent_folder_is_available_offline_file_child" = "Folder zawierający ten plik jest już dostępny offline";
"parent_folder_is_available_offline_folder_child" = "Folder zawierający ten folder jest już dostępny offline";

//Document provider
"error_login_doc_provider" = "Dostęp do Twojego konta jest niemożliwy. Użyj $appname, aby się zarejestrować. ";
"error_sending_file_to_document_picker" = "Błąd - plik nie może być wysłany do dokumentów";
"error_user_change_in_core_app" = "Użytkownik został zmieniony w aplikacji $appname";
"error_connecting_with_server" = "Nawiązanie połączenia z serwerem nie jest obecnie możliwe. Spróbuj ponownie później";
"move_doc_provider_button" = "Przenieś do...";
"export_doc_provider_button" = "Eksportuj do...";

//Instant uploads
"location_not_enabled"="Usługi lokalizacji są wyłączone";
"message_location_not_enabled"="Przejdź do ustawień i włącz usługi lokalizacji dla tej aplikacji aby umożliwić natychmiastowe przesyłanie zdjęć.";

"access_photos_library_not_enabled" = "Dostęp do biblioteki zdjęć jest wyłączony";
"message_access_photos_not_enabled" = "Przejdź do ustawień i zezwól na dostęp do zdjęć, aby umożliwić natychmiastowe przesyłanie zdjęć.";

//PDF reader
"page_of_pages" = "z"; //Example: 5 of 10

//Share in
"files_added" = "Dodano pliki";
"files_will_be_upload_next_time" = "Wczytywanie plików rozpocznie się przy następnym uruchomieniu $appname";

//Help Guide main app
"title_help_slide_0" = "Witaj w $appname!";
"message_help_slide_0" = "Przeciągnij by dowiedzieć się więcej";
"title_help_slide_1" = "Automatyczne wysyłanie";
"message_help_slide_1" = "Przechowuj bezpiecznie swoje zdjęcia ";
"title_help_slide_2" = "Zarządzaj wszystkimi swoimi plikami";
"message_help_slide_2" = "Możesz skasować, przenieść...";
"title_help_slide_3" = "Udostępnij";
"message_help_slide_3" = "Możesz współdzielić pliki i foldery";
"title_help_slide_4" = "Wiele kont";
"message_help_slide_4" = "Podłącz do wszystkich serwerów ownCloud";
"title_help_slide_5" = "Twoje pliki dostępne wszędzie";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "Zaloguj";
"skip_button_help_guide" = "Pomiń";

//Update Guide main app
"title_update_slide_0" = "Discover the new ownCloud App";
"message_update_slide_0" = "Rebuilt from scratch for iOS 11+";
"title_update_slide_1" = "PDF Viewer";
"message_update_slide_1" = "Easy Search and Navigation";
"title_update_slide_2" = "File Management";
"message_update_slide_2" = "Share Files and Folders";
"title_update_slide_3" = "Quick Access";
"message_update_slide_3" = "Complete Data Overview";
"title_update_slide_4" = "Multiple Accounts";
"message_update_slide_4" = "Access to all your clouds";
"title_update_slide_5" = "Get it for free on the AppStore";
"message_update_slide_5" = "Secure Data Management";
"sign_in_button_update_guide" = "Pobierz";
"skip_button_update_guide" = "Pobierz";

//Account menu
"menu_account_edit" = "Edycja Hasła";
"menu_account_clear_cache" = "Czyść pamięć podręczną";
"menu_account_log_out" = "Usuń konto";

//Common
"not_connected_to_internet" = "Urządzenie nie jest podłączone do internetu";
"bad_request" = "Bad request";
"method_not_allowed" = "Method not allowed";
"proxy_auth_required" = "Proxy authorization required";
"conflict" = "Konflikt";
"internal_error" = "Internal server error";
"not_implemented" = "Nie wdrożono";
"bad_gateway" = "Bad gateway";

//Private links
"private_link_redirection_failed" = "The item does not exist";
"error_connecting_with_server" = "Nawiązanie połączenia z serwerem nie jest obecnie możliwe. Spróbuj ponownie później";
"private_link_not_reachable" = " Private link could not be opened";
